app/controllers/applications_controller.rb

INSERT INTO "applications" ("submit_date", "status", "created_at", "updated_at", "borrower_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["submit_date", "2020-05-08"], ["status", "pending"], ["created_at", "2020-05-09 20:38:01.951233"], ["updated_at", "2020-05-09 20:38:01.951233"], ["borrower_id", 5]]
---
  def create
    @application = Application.new(application_params)

    if @application.save

UPDATE "applications" SET "submit_date" = $1, "status" = $2, "updated_at" = $3 WHERE "applications"."id" = $4  [["submit_date", "2020-05-08"], ["status", "pending"], ["updated_at", "2020-05-09 21:38:10.123651"], ["id", 5]]
---
  def update
    if @application.update(application_params)

SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_application
      @application = Application.find(params[:id])