app/controllers/applications_controller.rb

  def index
    @applications = Application.all
---
SELECT "applications".* FROM "applications"

  def show
    @application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    puts 'trying to create a new item'
    ## Our UI accepts information for loan when creating the application.
    ## will need to save that information as well, once the new application is saved to the DB without errors.
    # @application = Application.new(application_params)

    puts 'Examine the input parameters'
    puts application_params.inspect
    puts 'Instantiating the new Application record'
    @application = Application.new
    @application.submit_date = Date.current
    puts "date setting completed #{@application.submit_date}"
    @application.status = 'pending'
    puts "status set: #{@application.status}"

    @application.borrower_id = params[:application][:borrower_id]

    puts 'Instantiation completed'



    if @application.save
---
INSERT INTO "applications" ("submit_date", "status", "created_at", "updated_at", "borrower_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["submit_date", "2020-05-12"], ["status", "pending"], ["created_at", "2020-05-12 00:38:22.746500"], ["updated_at", "2020-05-12 00:38:22.746500"], ["borrower_id", 9]]


      puts 'Application POST route - saving underlying loan record'

      @loan.save
---
INSERT INTO "loans" ("created_at", "updated_at", "application_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-05-12 02:51:32.946507"], ["updated_at", "2020-05-12 02:51:32.946507"], ["application_id", 17]]

      ## if so, increment the existing counter
      ## otherwise, create a new record.

      @appsubmit = Appsubmit.find_by submit_date: Date.current
---
SELECT "appsubmits".* FROM "appsubmits" WHERE "appsubmits"."submit_date" = $1 LIMIT $2  [["submit_date", "2020-05-12"], ["LIMIT", 1]]

      if @appsubmit
        ## we found a record with the current date.  Increment the counter
        @appsubmit.count = @appsubmit.count + 1
        @appsubmit.save
      else
        @appsubmit= Appsubmit.new(submit_date: Date.current, count: 1)
        @appsubmit.save
---
INSERT INTO "appsubmits" ("submit_date", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["submit_date", "2020-05-12"], ["count", 1], ["created_at", "2020-05-12 00:54:35.049792"], ["updated_at", "2020-05-12 00:54:35.049792"]]
UPDATE "appsubmits" SET "count" = $1, "updated_at" = $2 WHERE "appsubmits"."id" = $3  [["count", 2], ["updated_at", "2020-05-12 02:51:32.955633"], ["id", 6]]

  def update

    if @application.update(application_params)
---
UPDATE "applications" SET "borrower_id" = $1, "updated_at" = $2 WHERE "applications"."id" = $3  [["borrower_id", 15], ["updated_at", "2020-05-12 23:29:31.210543"], ["id", 9]]

  def destroy
    ## before we kill the application, we need to do some clean up
    ## since I didn't do a good job with foreign keys and whatnot.
    ## 1.  delete / revise item in the appsubmit table.
    ## 2.  update corresponding records in Borrower table
    ## 3.  delete corresponding loan records.
    ## 4.  Application.destroy.
    @application.destroy
---
DELETE FROM "applications" WHERE "applications"."id" = $1  [["id", 15]]

    def set_application
      @application = Application.find(params[:id])
---
SELECT "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]