app/controllers/appsubmits_controller.rb

SELECT COUNT("appsubmits"."submit_date") AS count_submit_date, "appsubmits"."submit_date" AS appsubmits_submit_date FROM "appsubmits" GROUP BY "appsubmits"."submit_date"
---
  def index
    # @appsubmits = Appsubmit.all
    @appsubmits = Appsubmit.select(:submit_date).group(:submit_date).count

SELECT "appsubmits".* FROM "appsubmits" WHERE "appsubmits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_appsubmit
      @appsubmit = Appsubmit.find(params[:id])