app/controllers/borrowers_controller.rb

SELECT "borrowers".* FROM "borrowers" WHERE "borrowers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_borrower
      @borrower = Borrower.find(params[:id])