app/controllers/borrowers_controller.rb

SELECT "borrowers".* FROM "borrowers"
---
  def index
    @borrowers = Borrower.all

SELECT "borrowers".* FROM "borrowers" WHERE "borrowers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @borrower = Borrower.find(params[:id])

INSERT INTO "borrowers" ("name", "state", "business_segment", "created_at", "updated_at", "relationship_mgr_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Test LLC"], ["state", "MA"], ["business_segment", "Regional Bank"], ["created_at", "2020-05-09 19:52:26.667019"], ["updated_at", "2020-05-09 19:52:26.667019"], ["relationship_mgr_id", 2]]
---
  def create
    @borrower = Borrower.new(borrower_params)

    if @borrower.save