app/controllers/loans_controller.rb

  def index
    @loans = Loan.all
---
SELECT "loans".* FROM "loans"

    def set_loan
      @loan = Loan.find(params[:id])
---
SELECT "loans".* FROM "loans" WHERE "loans"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]