app/controllers/relationship_mgrs_controller.rb

SELECT "relationship_mgrs".* FROM "relationship_mgrs" WHERE "relationship_mgrs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @relationship_mgr = RelationshipMgr.find(params[:id])