app/controllers/relationship_mgrs_controller.rb

  def index
    @relationship_mgrs = RelationshipMgr.all
---
SELECT "relationship_mgrs".* FROM "relationship_mgrs"

    def set_relationship_mgr
      @relationship_mgr = RelationshipMgr.find(params[:id])
---
SELECT "relationship_mgrs".* FROM "relationship_mgrs" WHERE "relationship_mgrs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]